entity.org
#+HTML_HEAD: -*- fill-column: 92 -*-

#+TITLE: Модуль сущностей, автоматов и их тесты

#+NAME: css
#+BEGIN_HTML
<link rel="stylesheet" type="text/css" href="css/css.css" />
#+END_HTML

* Ведение

  Здесь напишем код, который развернет все описания сущностей в
  исполняемый код.

  Начнем с определения сущностей системы, а потом расширим их поддержку так, чтобы они
  могли поддерживать [[http://is.ifmo.ru/books/_book.pdf][Автоматное программирование]]:

  #+NAME: entity_file
  #+BEGIN_SRC lisp :tangle src/mod/entity.lisp :noweb tangle :exports code
    ;;;; entity.lisp

    (in-package #:moto)

    <<entity>>

    <<automat>>

    <<entity_test>>

    <<automat_test>>

    <<compute_outgoing_states>>

    <<possible_trans>>
  #+END_SRC

