entity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Модуль сущностей, автоматов и их тесты</title>
<!-- 2015-03-28 Сб. 06:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
-*- fill-column: 92 -*-
</head>
<body>
<div id="content">
<h1 class="title">Модуль сущностей, автоматов и их тесты</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Ведение</a></li>
<li><a href="#sec-2">2. Сущности</a></li>
<li><a href="#sec-3">3. Тесты сущностей</a></li>
<li><a href="#sec-4">4. Автоматы</a></li>
<li><a href="#sec-5">5. Тесты автоматов</a></li>
<li><a href="#sec-6">6. Определение возможных исходящих состояний автомата</a></li>
</ul>
</div>
</div>
<link rel="stylesheet" type="text/css" href="css/css.css" />

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ведение</h2>
<div class="outline-text-2" id="text-1">
<p>
Здесь напишем код, который развернет все описания сущностей в
исполняемый код.
</p>

<p>
Начнем с определения сущностей системы, а потом расширим их поддержку так, чтобы они
могли поддерживать <a href="http://is.ifmo.ru/books/_book.pdf">Автоматное программирование</a>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_file"><span style="color: #b22222;">;;;; </span><span style="color: #b22222;">entity.lisp</span>

(<span style="color: #a020f0;">in-package</span> #<span style="color: #483d8b;">:moto</span>)

&lt;&lt;entity&gt;&gt;

&lt;&lt;automat&gt;&gt;

&lt;&lt;entity_test&gt;&gt;

&lt;&lt;automat_test&gt;&gt;

&lt;&lt;compute_outgoing_states&gt;&gt;

&lt;&lt;possible_trans&gt;&gt;
</pre>
</div>
</div>
</div>
