entity.org
* Сущности

  Этот макрос генерирует код, который обслуживает все сущности. Я хочу, чтобы когда я
  определяю сущность, автоматически создавались функции, которые ее обслуживают:
  - ={entity}-class=       определение класса
  - =make-{entity}-table=  функция создания таблицы в бд, если она еще не создана
  - =make-{entity}=        конструктор сущности, который создает ее и записывает в базу данных
  - =upd-{entity}=         метод, который обновляет поля сущности (в т.ч. в базе данных)
  - =del-{entity}=         деструктор, который удаляет сущность, в т.ч. и из базы данных
  - =all-{entity}=         функция для получения коллекции сущностей
  - =get-{entity}=         функция для получения сущности по ее идентификтору
  - =find-{entity}=        функция для получения сущности по ее идентификтору
  - =show-{entity}=        функция для показа сущности (переопределить при необходимости)

  Нижеследующий код создает таблицы в базе данных, но не предполагает, что они будут
  изменяться в процессе работы, поэтому не обрабатывает последствия, требующие рассмотрения:
  - что будет, если переопределить класс с добавлением/удалением слотов?
  - что будет, если запустить новый образ лиспа - должна ли к каждому образу прилагаться
    своя БД?
  При реализации этой недостающей функциональности следует помнить, что классы - это
  экземпляры класса STANDARD-CLASS, и прицепив что угодно на initialize-instance :after для
  этого класса, можно добиться выполнения произвольного кода во время исполнения defclass.

  Лучше, конечно, определить свой метакласс (класс, экземплярами которого будут
  пользовательские классы).

  #+NAME: entity
  #+BEGIN_SRC lisp
    (defmacro define-entity (name desc flds primaryes foreigns uniques)
      (let ((*package* (symbol-package name)))
        `(progn
           <<entity_class>>
           <<make_entity_table>>
           <<make_entity>>
           <<upd_entity>>
           <<del_entity>>
           <<all_entity>>
           <<get_entity>>
           <<find_entity>>
           <<show_entity>>
           )))
  #+END_SRC

  Генерируем =entity-class=:

  #+NAME: entity_class
  #+BEGIN_SRC lisp

    ;; entity-class
    ,(let ((table (intern (symbol-name name))))
      `(defclass ,name ()
        ,(mapcar #'(lambda (x)
                     (list
                      (car x)
                      :col-type (cadr x)
                      :initarg  (intern (symbol-name (car x)) :keyword)
                      :accessor (car x)))
                 flds)
        (:metaclass dao-class)
        (:table-name ,table)
        (:keys ,(caar flds))))
  #+END_SRC

  Генерируем =make_entity-table=:

  #+NAME: make_entity_table
  #+BEGIN_SRC lisp

    ;; make-entity-table
    ,(let ((table (intern (symbol-name name))))
      `(defun ,(intern (concatenate 'string "MAKE-" (symbol-name name) "-TABLE")) ()
        (with-connection *db-spec*
          (unless (table-exists-p (string-downcase (symbol-name ',table)))
            (execute (dao-table-definition ',table))))))
  #+END_SRC

  Генерируем =make_entity=:

  #+NAME: make_entity
  #+BEGIN_SRC lisp

    ;; make-entity
    ,(let ((table (intern (symbol-name name))))
      `(defun ,(intern (concatenate 'string "MAKE-" (symbol-name name))) (&rest initargs)
        (with-connection *db-spec*
          (apply #'make-dao (list* ',table initargs)))))
  #+END_SRC

  Генерируем =update_entity=:

  #+NAME: upd_entity
  #+BEGIN_SRC lisp

    ;; upd-entity
    (defmethod ,(intern (concatenate 'string "UPD-" (symbol-name name))) ((obj ,name) &optional args)
      (progn
        ,@(loop :for accessor :in flds :collect
               `(setf (,(car accessor) obj)
                      (or (getf args ,(intern (symbol-name (car accessor)) :keyword))
                          (,(car accessor) obj))))
        (with-connection *db-spec*
          (update-dao obj))))
  #+END_SRC

  Генерируем =del_entity=:

  #+NAME: del_entity
  #+BEGIN_SRC lisp

    ;; del-entity
    ,(let ((table (intern (symbol-name name))))
      `(defun ,(intern (concatenate 'string "DEL-" (symbol-name name))) (id)
        (with-connection *db-spec*
          (delete-dao (get-dao ',table id)))))
  #+END_SRC

  Генерируем =all_entity=:

  #+NAME: all_entity
  #+BEGIN_SRC lisp

    ;; all-entity
    ,(let ((table (intern (symbol-name name))))
      `(defun ,(intern (concatenate 'string "ALL-" (symbol-name name))) ()
        (with-connection *db-spec*
          (select-dao ',table))))
  #+END_SRC

  Генерируем =get_entity=:

  #+NAME: get_entity
  #+BEGIN_SRC lisp

    ;; get-entity (by id)
    ,(let ((table      (intern (symbol-name name)))
           (get-entity (intern (concatenate 'string "GET-" (symbol-name name)))))
      `(defun ,get-entity (id &rest flds)
        (when (not (typep id 'integer))
          (err 'param-get-entity-is-not-integer))
        (with-connection *db-spec*
          (let ((obj (select-dao ',table (:= :id id)))
                (rs))
            (when (null obj)
              (return-from ,get-entity nil))
            (setf obj (car obj))
            (when (null obj)
              (return-from ,get-entity nil))
            (when (null flds)
              (return-from ,get-entity obj))
            (loop :for fld :in flds :collect
               (setf (getf rs (intern (symbol-name fld) :keyword))
                     (funcall (intern (symbol-name fld) (find-package ,(symbol-name name)))
                              obj)))
            rs))))
  #+END_SRC

  Генерируем =find_entity=:

  #+NAME: find_entity
  #+BEGIN_SRC lisp

    ;; find-entity
    ,(let ((table (intern (symbol-name name))))
      `(defun ,(intern (concatenate 'string "FIND-" (symbol-name name))) (&rest args)
        (with-connection *db-spec*
          (query-dao ',table
                     (sql-compile
                      (list :select :* :from ',table
                            :where (make-clause-list ':and ':= args)))))))
  #+END_SRC

  Генерируем =show_entity=:

  #+NAME: show_entity
  #+BEGIN_SRC lisp

    ;; show-entity
    (defmethod ,(intern "TO-HTML") ((obj ,name) &optional &key filter)
      (with-connection *db-spec*
        (concatenate 'string
                     "<form id='"
                     ,(string-downcase (symbol-name name))
                     "-form'>"
                     ,@(loop :for (fld-name fld-type) :in flds :collect
                          (list
                           (intern (concatenate 'string
                                                "SHOW-FLD-"
                                                (if (symbolp fld-type)
                                                    (symbol-name fld-type)
                                                    (format nil "~{~A~^-~}"
                                                            (mapcar #'(lambda (x)
                                                                        (symbol-name x))
                                                                    fld-type)))))
                           (list fld-name 'obj)))
                     "</form>")))
  #+END_SRC

