entity.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Сущности</h2>
<div class="outline-text-2" id="text-2">
<p>
Этот макрос генерирует код, который обслуживает все сущности. Мне
хотелось, чтобы когда я определяю сущность, автоматически
создавались функции, которые ее обслуживают:
</p>

<ul class="org-ul">
<li><code>{entity}-class</code>: Определение класса
</li>
<li><code>make-{entity}-table</code>: функция создания таблицы в бд, если она еще не создана
</li>
<li><code>make-{entity}</code>: конструктор сущности, который создает ее и записывает в базу данных
</li>
<li><code>upd-{entity}</code>: метод, который обновляет поля сущности (в т.ч. в базе данных)
</li>
<li><code>del-{entity}</code>: деструктор, который удаляет сущность, в т.ч. и из базы данных
</li>
<li><code>all-{entity}</code>: функция для получения коллекции сущностей
</li>
<li><code>get-{entity}</code>: функция для получения сущности по ее идентификтору
</li>
<li><code>find-{entity}</code>: функция для получения сущности по ее идентификтору
</li>
<li><code>show-{entity}</code>: функция для показа сущности (переопределить при необходимости)
</li>
</ul>

<p>
Нижеследующий код создает таблицы в базе данных, но не предполагает, что они будут
изменяться в процессе работы, поэтому не обрабатывает последствия, требующие рассмотрения:
</p>
<ul class="org-ul">
<li>что будет, если ты переопределишь класс с добавлением/удалением слотов?
</li>
<li>что будет, если ты запустил новый образ лиспа - должна ли к каждому образу прилагаться
своя БД?
</li>
</ul>
<p>
При реализации этой недостающей функциональности следует помнить, что классы - это
экземпляры класса STANDARD-CLASS, и прицепив что угодно на initialize-instance :after для
этого класса, можно добиться выполнения произвольного кода во время исполнения defclass.
</p>

<p>
Лучше, конечно, определить свой метакласс (класс, экземплярами которого будут
пользовательские классы).
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">define-entity</span> (name desc <span style="color: #228b22;">&amp;rest</span> tail)
  (<span style="color: #a020f0;">let</span> ((*package* (symbol-package name)))
    `(<span style="color: #a020f0;">progn</span>
       &lt;&lt;entity_class&gt;&gt;
       &lt;&lt;make_entity_table&gt;&gt;
       &lt;&lt;make_entity&gt;&gt;
       &lt;&lt;upd_entity&gt;&gt;
       &lt;&lt;del_entity&gt;&gt;
       &lt;&lt;all_entity&gt;&gt;
       &lt;&lt;get_entity&gt;&gt;
       &lt;&lt;find_entity&gt;&gt;
       &lt;&lt;show_entity&gt;&gt;
       )))
</pre>
</div>

<p>
Генерируем <code>entity-class</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_class"><span style="color: #b22222;">;; </span><span style="color: #b22222;">entity-class</span>
,(<span style="color: #a020f0;">let</span> ((table (intern (symbol-name name))))
  `(<span style="color: #a020f0;">defclass</span> ,name ()
    ,(mapcar #'(<span style="color: #a020f0;">lambda</span> (x)
                 (list
                  (car x)
                  <span style="color: #483d8b;">:col-type</span> (cadr x)
                  <span style="color: #483d8b;">:initarg</span>  (intern (symbol-name (car x)) <span style="color: #483d8b;">:keyword</span>)
                  <span style="color: #483d8b;">:accessor</span> (car x)))
             (car tail))
    (<span style="color: #483d8b;">:metaclass</span> dao-class)
    (<span style="color: #483d8b;">:table-name</span> ,table)
    (<span style="color: #483d8b;">:keys</span> ,(caaar tail))))
</pre>
</div>

<p>
Генерируем <code>make_entity-table</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="make_entity_table"><span style="color: #b22222;">;; </span><span style="color: #b22222;">make-entity-table</span>
,(<span style="color: #a020f0;">let</span> ((table (intern (symbol-name name))))
  `(<span style="color: #a020f0;">defun</span> ,(intern (concatenate 'string <span style="color: #8b2252;">"MAKE-"</span> (symbol-name name) <span style="color: #8b2252;">"-TABLE"</span>)) ()
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (<span style="color: #a020f0;">unless</span> (table-exists-p (string-downcase (symbol-name ',table)))
        (execute (dao-table-definition ',table))))))
</pre>
</div>

<p>
Генерируем <code>make_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="make_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">make-entity</span>
,(<span style="color: #a020f0;">let</span> ((table (intern (symbol-name name))))
  `(<span style="color: #a020f0;">defun</span> ,(intern (concatenate 'string <span style="color: #8b2252;">"MAKE-"</span> (symbol-name name))) (<span style="color: #228b22;">&amp;rest</span> initargs)
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (apply #'make-dao (list* ',table initargs)))))
</pre>
</div>

<p>
Генерируем <code>update_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="upd_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">upd-entity</span>
(<span style="color: #a020f0;">defmethod</span> ,(intern (concatenate 'string <span style="color: #8b2252;">"UPD-"</span> (symbol-name name))) ((obj ,name) <span style="color: #228b22;">&amp;optional</span> args)
  (<span style="color: #a020f0;">progn</span>
    ,@(<span style="color: #a020f0;">loop</span> for accessor in (car tail) <span style="color: #483d8b;">:collect</span>
           `(setf (,(car accessor) obj)
                  (or (getf args ,(intern (symbol-name (car accessor)) <span style="color: #483d8b;">:keyword</span>))
                      (,(car accessor) obj))))
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (update-dao obj))))
</pre>
</div>

<p>
Генерируем <code>del_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="del_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">del-entity</span>
,(<span style="color: #a020f0;">let</span> ((table (intern (symbol-name name))))
  `(<span style="color: #a020f0;">defun</span> ,(intern (concatenate 'string <span style="color: #8b2252;">"DEL-"</span> (symbol-name name))) (id)
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (delete-dao (get-dao ',table id)))))
</pre>
</div>

<p>
Генерируем <code>all_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="all_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">all-entity</span>
,(<span style="color: #a020f0;">let</span> ((table (intern (symbol-name name))))
  `(<span style="color: #a020f0;">defun</span> ,(intern (concatenate 'string <span style="color: #8b2252;">"ALL-"</span> (symbol-name name))) ()
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (select-dao ',table))))
</pre>
</div>

<p>
Генерируем <code>get_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="get_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">get-entity (by id)</span>
,(<span style="color: #a020f0;">let</span> ((table      (intern (symbol-name name)))
       (get-entity (intern (concatenate 'string <span style="color: #8b2252;">"GET-"</span> (symbol-name name)))))
  `(<span style="color: #a020f0;">defun</span> ,get-entity (id <span style="color: #228b22;">&amp;rest</span> flds)
    (<span style="color: #a020f0;">when</span> (not (typep id 'integer))
      (err 'param-get-entity-is-not-integer))
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (<span style="color: #a020f0;">let</span> ((obj (select-dao ',table (<span style="color: #483d8b;">:=</span> <span style="color: #483d8b;">:id</span> id)))
            (rs))
        (<span style="color: #a020f0;">when</span> (null obj)
          (<span style="color: #a020f0;">return-from</span> ,get-entity nil))
        (setf obj (car obj))
        (<span style="color: #a020f0;">when</span> (null obj)
          (<span style="color: #a020f0;">return-from</span> ,get-entity nil))
        (<span style="color: #a020f0;">when</span> (null flds)
          (<span style="color: #a020f0;">return-from</span> ,get-entity obj))
        (<span style="color: #a020f0;">loop</span> <span style="color: #483d8b;">:for</span> fld <span style="color: #483d8b;">:in</span> flds <span style="color: #483d8b;">:collect</span>
           (setf (getf rs (intern (symbol-name fld) <span style="color: #483d8b;">:keyword</span>))
                 (funcall (intern (symbol-name fld) (find-package ,(symbol-name name)))
                          obj)))
        rs))))
</pre>
</div>

<p>
Генерируем <code>find_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="find_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">find-entity</span>
,(<span style="color: #a020f0;">let</span> ((table (intern (symbol-name name))))
  `(<span style="color: #a020f0;">defun</span> ,(intern (concatenate 'string <span style="color: #8b2252;">"FIND-"</span> (symbol-name name))) (<span style="color: #228b22;">&amp;rest</span> args)
    (<span style="color: #a020f0;">with-connection</span> *db-spec*
      (query-dao ',table
                 (sql-compile
                  (list <span style="color: #483d8b;">:select</span> <span style="color: #483d8b;">:*</span> <span style="color: #483d8b;">:from</span> ',table
                        <span style="color: #483d8b;">:where</span> (make-clause-list '<span style="color: #483d8b;">:and</span> '<span style="color: #483d8b;">:=</span> args)))))))
</pre>
</div>

<p>
Генерируем <code>show_entity</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="show_entity"><span style="color: #b22222;">;; </span><span style="color: #b22222;">show-entity</span>
(<span style="color: #a020f0;">defmethod</span> ,(intern <span style="color: #8b2252;">"TO-HTML"</span>) ((obj ,name) <span style="color: #228b22;">&amp;optional</span> <span style="color: #228b22;">&amp;key</span> filter)
  (<span style="color: #a020f0;">with-connection</span> *db-spec*
    (concatenate 'string
                 <span style="color: #8b2252;">"&lt;form id='"</span>
                 ,(string-downcase (symbol-name name))
                 <span style="color: #8b2252;">"-form'&gt;"</span>
                 ,@(<span style="color: #a020f0;">loop</span> <span style="color: #483d8b;">:for</span> (fld-name fld-type) <span style="color: #483d8b;">:in</span> (car tail) <span style="color: #483d8b;">:collect</span>
                      (list
                       (intern (concatenate 'string
                                            <span style="color: #8b2252;">"SHOW-FLD-"</span>
                                            (<span style="color: #a020f0;">if</span> (symbolp fld-type)
                                                (symbol-name fld-type)
                                                (format nil <span style="color: #8b2252;">"~{~A~^-~}"</span>
                                                        (mapcar #'(<span style="color: #a020f0;">lambda</span> (x)
                                                                    (symbol-name x))
                                                                fld-type)))))
                       (list fld-name 'obj)))
                 <span style="color: #8b2252;">"&lt;/form&gt;"</span>)))
</pre>
</div>
</div>
</div>
