entity.org
* Тесты сущностей

  Теперь у нас есть генератор всех необходимых функций для обслуживания любых
  сущностей. Мы можем это протестировать, для этого сформируем тест:

  #+NAME: entity_test
  #+BEGIN_SRC lisp

    ;; Тестируем сущности
    (defun entity-test ()
      <<entity_test_contents>>
      (dbg "passed: entity-test~%"))
    (entity-test)
  #+END_SRC

  Придумаем имя новой сущности и таблицы в которую она отображается. Пусть для простоты это
  будет =entity123=.

  Сначала убедимся, что тестовой таблицы в базе нет. Если она все-таки есть - удалим.

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (when (with-connection *db-spec*
              (query (:select 'table_name :from 'information_schema.tables :where
                              (:and (:= 'table_schema "public")
                                    (:= 'table_name "entity123")))))
      (with-connection *db-spec*
        (query (:drop-table 'entity123))))
  #+END_SRC

  Определим новыю сущность и вызовем создание таблицы средствами наших сгенерированных
  функций. Проверим, что таблица успешно создана.

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (define-entity entity123 "Тестовая сущность"
      ((id serial)
       (email varchar)
       (name (or db-null varchar)))
      (id)
      ()
      ())

    (make-entity123-table)

    (assert (not (null (with-connection *db-spec*
                         (query (:select 'table_name :from 'information_schema.tables :where
                                         (:and (:= 'table_schema "public")
                                               (:= 'table_name "entity123"))))))))
  #+END_SRC


  Сформируем сущность и проверим, что она появилась в таблице:

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (make-entity123 :email "test-email-1" :name "test-name-1")

    (assert (not (null (with-connection *db-spec*
                         (query (:select '* :from 'entity123))))))
  #+END_SRC

  Проверим, что ее можно получить из =get-{entity}=

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (assert (not (null (get-entity123 1))))
  #+END_SRC

  Попробуем изменить в ней некоторые поля и проверим, что меняется сущность и ее
  отображение в таблице:

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (upd-entity123 (get-entity123 1) (list :name "new-name"))

    (assert (equal "new-name" (name (get-entity123 1))))

    (assert (equal "new-name"
                   (caar
                    (with-connection *db-spec*
                      (query (:select 'name :from 'entity123 :where (:= 'id 1)))))))
  #+END_SRC

  Попробуем удалить сущность

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (del-entity123 1)

    (assert (null (with-connection *db-spec*
                    (query (:select '* :from 'entity123 :where (:= 'id 1))))))
  #+END_SRC

  Создадим еще парочку разных сущностей проверим получение всех сущностей и проверим что
  по сущностям работает поиск.

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (make-entity123 :email "test-email-2" :name "test-name-2")
    (make-entity123 :email "test-email-3" :name "test-name-3")

    (assert (equal 2 (length (all-entity123))))

    (assert (equal "test-email-3"
                   (email (car (find-entity123 :name "test-name-3")))))
  #+END_SRC

  Подчистим за собой - удалим таблицу

  #+NAME: entity_test_contents
  #+BEGIN_SRC lisp

    (with-connection *db-spec*
      (query (:drop-table 'entity123)))
  #+END_SRC

  Теперь мы можем быть уверенными, что сущности работают нормально.

* Автоматы

  Чтобы добавить состояние к нашим сущностям, мы должны обернуть их макросом, который
  добавит в сущность еще одно поле - =state= и создаст специализированные методы =trans=
  для каждого перехода между состояниями. Внутри себя =trans= вызывает функцию,
  одноименную с действием перехода - таким образом воплощаются действия на переходах.

  Эти методы будут вызываться из метода =takt=, который принимает объект сущности и его
  новое состояние. Если переход из старого состояния в новое не описан - это закономерно
  вызывает ошибку.

  #+NAME: automat
  #+BEGIN_SRC lisp
    (defmacro define-automat (name desc flds primaryes foreigns uniques states acts)
      (let ((package (symbol-package name)))
        (let ((upd-entity (intern (concatenate 'string "UPD-" (symbol-name name))))
              (fields (append flds '((state (or db-null varchar)))))
              (state  (intern "STATE" package))
              (trans  (intern "TRANS" package))
              (takt   (intern "TAKT" package))
              (make-table (intern (concatenate 'string "MAKE-"  (symbol-name name) "-TABLE"))))
          `(progn
             (define-entity ,name ,desc ,fields ,primaryes ,foreigns ,uniques)
             (,make-table)
             ,(let ((all-states states))
                   `(progn
                      ,@(loop :for (from-state to-state event) :in acts :collect
                           (if (or (null (find from-state all-states))
                                   (null (find to-state all-states)))
                               (err (format nil "unknown state: ~A -> ~A" from-state to-state))
                               `(defmethod ,trans ((obj ,name)
                                                   (from-state (eql ,from-state))
                                                   (to-state (eql ,to-state)))
                                  (prog1 (,(intern (symbol-name event) *package*))
                                    (,upd-entity obj (list :state ,(bprint to-state)))))))
                      (defmethod ,takt ((obj ,name) new-state)
                        (,trans obj (read-from-string (,state obj)) new-state))))))))
  #+END_SRC

