entity.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Тесты сущностей</h2>
<div class="outline-text-2" id="text-3">
<p>
Теперь у нас есть генератор всех необходимых функций для обслуживания любых
сущностей. Мы можем это протестировать, для этого сформируем тест:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">entity-test</span> ()
  &lt;&lt;entity_test_contents&gt;&gt;
  (dbg <span style="color: #8b2252;">"passed: entity-test~%"</span>))
(entity-test)
</pre>
</div>

<p>
Придумаем имя новой сущности и таблицы в которую она отображается. Пусть для простоты это
будет <code>entity123</code>.
</p>

<p>
Сначала убедимся, что тестовой таблицы в базе нет. Если она все-таки есть - удалим.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">with-connection</span> *db-spec*
          (query (<span style="color: #483d8b;">:select</span> 'table_name <span style="color: #483d8b;">:from</span> 'information_schema.tables <span style="color: #483d8b;">:where</span>
                          (<span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:=</span> 'table_schema <span style="color: #8b2252;">"public"</span>)
                                (<span style="color: #483d8b;">:=</span> 'table_name <span style="color: #8b2252;">"entity123"</span>)))))
  (<span style="color: #a020f0;">with-connection</span> *db-spec*
    (query (<span style="color: #483d8b;">:drop-table</span> 'entity123))))
</pre>
</div>

<p>
Определим новыю сущность и вызовем создание таблицы средствами наших сгенерированных
функций. Проверим, что таблица успешно создана.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(<span style="color: #a020f0;">define-entity</span> entity123 <span style="color: #8b2252;">"&#1058;&#1077;&#1089;&#1090;&#1086;&#1074;&#1072;&#1103; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1100;"</span>
  ((id serial)
   (email varchar)
   (name (or db-null varchar))))

(make-entity123-table)

(<span style="color: #ff0000; font-weight: bold;">assert</span> (not (null (<span style="color: #a020f0;">with-connection</span> *db-spec*
                     (query (<span style="color: #483d8b;">:select</span> 'table_name <span style="color: #483d8b;">:from</span> 'information_schema.tables <span style="color: #483d8b;">:where</span>
                                     (<span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:=</span> 'table_schema <span style="color: #8b2252;">"public"</span>)
                                           (<span style="color: #483d8b;">:=</span> 'table_name <span style="color: #8b2252;">"entity123"</span>))))))))
</pre>
</div>


<p>
Сформируем сущность и проверим, что она появилась в таблице:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(make-entity123 <span style="color: #483d8b;">:email</span> <span style="color: #8b2252;">"test-email-1"</span> <span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"test-name-1"</span>)

(<span style="color: #ff0000; font-weight: bold;">assert</span> (not (null (<span style="color: #a020f0;">with-connection</span> *db-spec*
                     (query (<span style="color: #483d8b;">:select</span> '* <span style="color: #483d8b;">:from</span> 'entity123))))))
</pre>
</div>

<p>
Проверим, что ее можно получить из <code>get-{entity}</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(<span style="color: #ff0000; font-weight: bold;">assert</span> (not (null (get-entity123 1))))
</pre>
</div>

<p>
Попробуем изменить в ней некоторые поля и проверим, что меняется сущность и ее
отображение в таблице:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(upd-entity123 (get-entity123 1) (list <span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"new-name"</span>))

(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #8b2252;">"new-name"</span> (name (get-entity123 1))))

(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #8b2252;">"new-name"</span>
               (caar
                (<span style="color: #a020f0;">with-connection</span> *db-spec*
                  (query (<span style="color: #483d8b;">:select</span> 'name <span style="color: #483d8b;">:from</span> 'entity123 <span style="color: #483d8b;">:where</span> (<span style="color: #483d8b;">:=</span> 'id 1)))))))
</pre>
</div>

<p>
Попробуем удалить сущность
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(del-entity123 1)

(<span style="color: #ff0000; font-weight: bold;">assert</span> (null (<span style="color: #a020f0;">with-connection</span> *db-spec*
                (query (<span style="color: #483d8b;">:select</span> '* <span style="color: #483d8b;">:from</span> 'entity123 <span style="color: #483d8b;">:where</span> (<span style="color: #483d8b;">:=</span> 'id 1))))))
</pre>
</div>

<p>
Создадим еще парочку разных сущностей проверим получение всех сущностей и проверим что
по сущностям работает поиск.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(make-entity123 <span style="color: #483d8b;">:email</span> <span style="color: #8b2252;">"test-email-2"</span> <span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"test-name-2"</span>)
(make-entity123 <span style="color: #483d8b;">:email</span> <span style="color: #8b2252;">"test-email-3"</span> <span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"test-name-3"</span>)

(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (length (all-entity123))))

(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #8b2252;">"test-email-3"</span>
               (email (car (find-entity123 <span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"test-name-3"</span>)))))
</pre>
</div>

<p>
Подчистим за собой - удалим таблицу
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="entity_test_contents">(<span style="color: #a020f0;">with-connection</span> *db-spec*
  (query (<span style="color: #483d8b;">:drop-table</span> 'entity123)))
</pre>
</div>

<p>
Теперь мы можем быть уверенными, что сущности работают нормально.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Автоматы</h2>
<div class="outline-text-2" id="text-4">
<p>
Чтобы добавить состояние к нашим сущностям, мы должны обернуть их макросом, который
добавит в сущность еще одно поле - <code>state</code> и создаст специализированные методы <code>trans</code>
для каждого перехода между состояниями. Внутри себя <code>trans</code> вызывает функцию,
одноименную с действием перехода - таким образом воплощаются действия на переходах.
</p>

<p>
Эти методы будут вызываться из метода <code>takt</code>, который принимает объект сущности и его
новое состояние. Если переход из старого состояния в новое не описан - это закономерно
вызывает ошибку.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">define-automat</span> (name desc <span style="color: #228b22;">&amp;rest</span> tail)
  (<span style="color: #a020f0;">let</span> ((package (symbol-package name)))
    (<span style="color: #a020f0;">let</span> ((upd-entity (intern (concatenate 'string <span style="color: #8b2252;">"UPD-"</span> (symbol-name name))))
          (fields (append (car tail) '((state (or db-null varchar)))))
          (state  (intern <span style="color: #8b2252;">"STATE"</span> package))
          (trans  (intern <span style="color: #8b2252;">"TRANS"</span> package))
          (takt   (intern <span style="color: #8b2252;">"TAKT"</span> package))
          (make-table (intern (concatenate 'string <span style="color: #8b2252;">"MAKE-"</span>  (symbol-name name) <span style="color: #8b2252;">"-TABLE"</span>))))
      `(<span style="color: #a020f0;">progn</span>
         (<span style="color: #a020f0;">define-entity</span> ,name ,desc ,fields)
         (,make-table)
         ,(<span style="color: #a020f0;">let</span> ((all-states (cadr tail)))
               `(<span style="color: #a020f0;">progn</span>
                  ,@(<span style="color: #a020f0;">loop</span> <span style="color: #483d8b;">:for</span> (from-state to-state event) <span style="color: #483d8b;">:in</span> (caddr tail) <span style="color: #483d8b;">:collect</span>
                       (<span style="color: #a020f0;">if</span> (or (null (find from-state all-states))
                               (null (find to-state all-states)))
                           (err (format nil <span style="color: #8b2252;">"unknown state: ~A -&gt; ~A"</span> from-state to-state))
                           `(<span style="color: #a020f0;">defmethod</span> ,trans ((obj ,name)
                                               (from-state (eql ,from-state))
                                               (to-state (eql ,to-state)))
                              (<span style="color: #a020f0;">prog1</span> (,(intern (symbol-name event) *package*))
                                (,upd-entity obj (list <span style="color: #483d8b;">:state</span> ,(bprint to-state)))))))
                  (<span style="color: #a020f0;">defmethod</span> ,takt ((obj ,name) new-state)
                    (,trans obj (read-from-string (,state obj)) new-state))))))))
</pre>
</div>
</div>
</div>
