entity.org
* Тесты автоматов

  Чтобы протестировать автоматы - формируем тест:

  #+NAME: automat_test
  #+BEGIN_SRC lisp

    ;; Тестируем автоматы
    (defun automat-test ()
      <<automat_test_contents>>
      (dbg "passed: automat-test~%"))
    (automat-test)
  #+END_SRC

  Придумаем имя новому автомату и таблицы в которую он отображается. Пусть для простоты
  это будет =automat123=.

  Сначала убедимся, что тестовой таблицы в базе нет. Если она все-таки есть - удалим.

  #+NAME: automat_test_contents
  #+BEGIN_SRC lisp

    (when (with-connection *db-spec*
              (query (:select 'table_name :from 'information_schema.tables :where
                              (:and (:= 'table_schema "public")
                                    (:= 'table_name "automat123")))))
      (with-connection *db-spec*
        (query (:drop-table 'automat123))))
  #+END_SRC

  Определим новыю сущность и вызовем создание таблицы средствами наших сгенерированных
  функций. Проверим, что таблица успешно создана. Проверим, что в таблице есть поле =state=.

  #+NAME: automat_test_contents
  #+BEGIN_SRC lisp

    (define-automat automat123 "Тестовый автомат"
      ((id serial)
       (email varchar)
       (name (or db-null varchar)))
      (id)
      ()
      ()
      (:on :off :broken)
      ((:on      :off     :switch-off)
       (:off     :on      :switch-on)
       (:on      :broken  :fault)
       (:broken  :off     :stop)))

    (assert (not (null (with-connection *db-spec*
                         (query (:select 'table_name :from 'information_schema.tables :where
                                         (:and (:= 'table_schema "public")
                                               (:= 'table_name "automat123"))))))))

    (assert (not (null
                  (with-connection *db-spec*
                    (query (:select 'column_name :from 'information_schema.columns :where
                                    (:and (:= 'table_schema  "public")
                                          (:= 'table_name    "automat123")
                                          (:= 'column_name   "state"))))))))
  #+END_SRC

  Сформируем автомат, установим начальное состояние и определим функции
  перехода. Протестируем все верные переходы и убедимся, что в конце теста состояние
  внутри таблицы верно.

  #+NAME: automat_test_contents
  #+BEGIN_SRC lisp

    (make-automat123 :email "test-email-1" :name "test-name-1")

    (upd-automat123 (get-automat123 1) (list :state ":off"))

    (defun switch-off ()
      :switch-off)

    (defun switch-on ()
      :switch-on)

    (defun fault ()
      :fault)

    (defun stop ()
      :stop)

    (assert (equal '((:SWITCH-ON ":ON") (:SWITCH-OFF ":OFF") (:SWITCH-ON ":ON")
                     (:FAULT ":BROKEN") (:STOP ":OFF"))
                   (loop :for new-state :in '(:on :off :on :broken :off) :collect
                      (list (takt (get-automat123 1) new-state)
                            (state (get-automat123 1))))))
    (assert (not (null
                  (with-connection *db-spec*
                    (query (:select 'state :from 'automat123 :where
                                    (:and
                                     (:= 'id 1)
                                     (:= 'state ":OFF"))))))))
  #+END_SRC

  Протестируем выброс ошибки в случае попытки неразрешенного перехода

  #+NAME: automat_test_contents
  #+BEGIN_SRC lisp
    (let ((test t) (err nil))
      (handler-case
          (progn
            (takt (get-automat123 1) :broken)
            (setf test nil))
        (simple-error ()
          (setf err t))
        (assert (and test err))))
  #+END_SRC

  Подчистим за собой - удалим таблицу

  #+NAME: automat_test_contents
  #+BEGIN_SRC lisp

    (with-connection *db-spec*
      (query (:drop-table 'automat123)))
  #+END_SRC

  Теперь мы можем быть уверенными, что автоматы работают нормально.

