entity.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Тесты автоматов</h2>
<div class="outline-text-2" id="text-5">
<p>
Чтобы протестировать автоматы - формируем тест:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat_test"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1099;</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">automat-test</span> ()
  &lt;&lt;automat_test_contents&gt;&gt;
  (dbg <span style="color: #8b2252;">"passed: automat-test~%"</span>))
(automat-test)
</pre>
</div>

<p>
Придумаем имя новому автомату и таблицы в которую он отображается. Пусть для простоты
это будет <code>automat123</code>.
</p>

<p>
Сначала убедимся, что тестовой таблицы в базе нет. Если она все-таки есть - удалим.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat_test_contents">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">with-connection</span> *db-spec*
          (query (<span style="color: #483d8b;">:select</span> 'table_name <span style="color: #483d8b;">:from</span> 'information_schema.tables <span style="color: #483d8b;">:where</span>
                          (<span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:=</span> 'table_schema <span style="color: #8b2252;">"public"</span>)
                                (<span style="color: #483d8b;">:=</span> 'table_name <span style="color: #8b2252;">"automat123"</span>)))))
  (<span style="color: #a020f0;">with-connection</span> *db-spec*
    (query (<span style="color: #483d8b;">:drop-table</span> 'automat123))))
</pre>
</div>

<p>
Определим новыю сущность и вызовем создание таблицы средствами наших сгенерированных
функций. Проверим, что таблица успешно создана. Проверим, что в таблице есть поле <code>state</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat_test_contents">(<span style="color: #a020f0;">define-automat</span> automat123 <span style="color: #8b2252;">"&#1058;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;"</span>
  ((id serial)
   (email varchar)
   (name (or db-null varchar)))
  (<span style="color: #483d8b;">:on</span> <span style="color: #483d8b;">:off</span> <span style="color: #483d8b;">:broken</span>)
  ((<span style="color: #483d8b;">:on</span>      <span style="color: #483d8b;">:off</span>     <span style="color: #483d8b;">:switch-off</span>)
   (<span style="color: #483d8b;">:off</span>     <span style="color: #483d8b;">:on</span>      <span style="color: #483d8b;">:switch-on</span>)
   (<span style="color: #483d8b;">:on</span>      <span style="color: #483d8b;">:broken</span>  <span style="color: #483d8b;">:fault</span>)
   (<span style="color: #483d8b;">:broken</span>  <span style="color: #483d8b;">:off</span>     <span style="color: #483d8b;">:stop</span>)))

(<span style="color: #ff0000; font-weight: bold;">assert</span> (not (null (<span style="color: #a020f0;">with-connection</span> *db-spec*
                     (query (<span style="color: #483d8b;">:select</span> 'table_name <span style="color: #483d8b;">:from</span> 'information_schema.tables <span style="color: #483d8b;">:where</span>
                                     (<span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:=</span> 'table_schema <span style="color: #8b2252;">"public"</span>)
                                           (<span style="color: #483d8b;">:=</span> 'table_name <span style="color: #8b2252;">"automat123"</span>))))))))

(<span style="color: #ff0000; font-weight: bold;">assert</span> (not (null
              (<span style="color: #a020f0;">with-connection</span> *db-spec*
                (query (<span style="color: #483d8b;">:select</span> 'column_name <span style="color: #483d8b;">:from</span> 'information_schema.columns <span style="color: #483d8b;">:where</span>
                                (<span style="color: #483d8b;">:and</span> (<span style="color: #483d8b;">:=</span> 'table_schema  <span style="color: #8b2252;">"public"</span>)
                                      (<span style="color: #483d8b;">:=</span> 'table_name    <span style="color: #8b2252;">"automat123"</span>)
                                      (<span style="color: #483d8b;">:=</span> 'column_name   <span style="color: #8b2252;">"state"</span>))))))))
</pre>
</div>

<p>
Сформируем автомат, установим начальное состояние и определим функции
перехода. Протестируем все верные переходы и убедимся, что в конце теста состояние
внутри таблицы верно.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat_test_contents">(make-automat123 <span style="color: #483d8b;">:email</span> <span style="color: #8b2252;">"test-email-1"</span> <span style="color: #483d8b;">:name</span> <span style="color: #8b2252;">"test-name-1"</span>)

(upd-automat123 (get-automat123 1) (list <span style="color: #483d8b;">:state</span> <span style="color: #8b2252;">":off"</span>))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">switch-off</span> ()
  <span style="color: #483d8b;">:switch-off</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">switch-on</span> ()
  <span style="color: #483d8b;">:switch-on</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">fault</span> ()
  <span style="color: #483d8b;">:fault</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">stop</span> ()
  <span style="color: #483d8b;">:stop</span>)

(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((<span style="color: #483d8b;">:SWITCH-ON</span> <span style="color: #8b2252;">":ON"</span>) (<span style="color: #483d8b;">:SWITCH-OFF</span> <span style="color: #8b2252;">":OFF"</span>) (<span style="color: #483d8b;">:SWITCH-ON</span> <span style="color: #8b2252;">":ON"</span>)
                 (<span style="color: #483d8b;">:FAULT</span> <span style="color: #8b2252;">":BROKEN"</span>) (<span style="color: #483d8b;">:STOP</span> <span style="color: #8b2252;">":OFF"</span>))
               (<span style="color: #a020f0;">loop</span> <span style="color: #483d8b;">:for</span> new-state <span style="color: #483d8b;">:in</span> '(<span style="color: #483d8b;">:on</span> <span style="color: #483d8b;">:off</span> <span style="color: #483d8b;">:on</span> <span style="color: #483d8b;">:broken</span> <span style="color: #483d8b;">:off</span>) <span style="color: #483d8b;">:collect</span>
                  (list (takt (get-automat123 1) new-state)
                        (state (get-automat123 1))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (not (null
              (<span style="color: #a020f0;">with-connection</span> *db-spec*
                (query (<span style="color: #483d8b;">:select</span> 'state <span style="color: #483d8b;">:from</span> 'automat123 <span style="color: #483d8b;">:where</span>
                                (<span style="color: #483d8b;">:and</span>
                                 (<span style="color: #483d8b;">:=</span> 'id 1)
                                 (<span style="color: #483d8b;">:=</span> 'state <span style="color: #8b2252;">":OFF"</span>))))))))
</pre>
</div>

<p>
Протестируем выброс ошибки в случае попытки неразрешенного перехода
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat_test_contents">(<span style="color: #a020f0;">let</span> ((test t) (err nil))
  (<span style="color: #a020f0;">handler-case</span>
      (<span style="color: #a020f0;">progn</span>
        (takt (get-automat123 1) <span style="color: #483d8b;">:broken</span>)
        (setf test nil))
    (simple-error ()
      (setf err t))
    (<span style="color: #ff0000; font-weight: bold;">assert</span> (and test err))))
</pre>
</div>

<p>
Подчистим за собой - удалим таблицу
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="automat_test_contents">(<span style="color: #a020f0;">with-connection</span> *db-spec*
  (query (<span style="color: #483d8b;">:drop-table</span> 'automat123)))
</pre>
</div>

<p>
Теперь мы можем быть уверенными, что автоматы работают нормально.
</p>
</div>
</div>
