entity.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Определение возможных исходящих состояний автомата</h2>
<div class="outline-text-2" id="text-6">
<p>
Чтобы определить, в какое состояние можно перевести автомат из текущего - необходимо
интроспективно проанализировать eql-спецификаторы метода trans и выбрать из них применимые
для текущего состояния.
</p>

<p>
Что и делает эта функция:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="compute_outgoing_states">(<span style="color: #a020f0;">in-package</span> #<span style="color: #483d8b;">:moto</span>)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">compute-outgoing-states</span> (the-class source-state)
  (<span style="color: #a020f0;">let</span> ((applicable-methods))
    (<span style="color: #a020f0;">loop</span> <span style="color: #483d8b;">:for</span> trans-method <span style="color: #483d8b;">:in</span> (closer-mop:generic-function-methods #'trans) <span style="color: #483d8b;">:do</span>
       (<span style="color: #a020f0;">let</span> ((specializers (closer-mop:method-specializers trans-method)))
         (<span style="color: #a020f0;">when</span> (and (equal the-class (class-name (car specializers)))
                    (equal source-state (closer-mop:eql-specializer-object (cadr specializers))))
           (push (closer-mop:eql-specializer-object (nth 2 specializers)) applicable-methods))))
    applicable-methods))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">(compute-outgoing-states 'vacancy :responded)</span>
</pre>
</div>

<p>
Для удобства использования можно вычислять возможные переходы для конкретного объекта
автомата:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="possible_trans">(<span style="color: #a020f0;">in-package</span> #<span style="color: #483d8b;">:moto</span>)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">possible-trans</span> ((obj t))
  (compute-outgoing-states
   (class-name (class-of obj))
   (intern (subseq (state obj) 1) <span style="color: #483d8b;">:keyword</span>)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">(possible-trans (get-vacancy 1))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2015-03-28 Сб. 06:27</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
